{
    "abstract": "The Chinese room problem, since being postulated by John Searle in 1980, has been the basis of much discussion surrounding the ideas of consciousness, thought, understanding, and the mind-body problem. The argument asserts that if someone has a book which gives them rules for writing responses to queries in a language they do not understand, although they may have sufficient information to fool a native speaker into thinking they are corresponding with someone who understands, they do not understand the dialogue in the sense that they would if the same experiment were done with queries in the person’s native language. However, there has been very little exploration of the implied contrasting argument. When Searle states that he understands English, and hence is able to understand the meaning of statements which are posed in English, and use that understanding to consciously construct responses, I am inclined to believe it, as he appears to me to be a creative individual, and a self-aware free thinker. On the other hand, I do not believe that this applies universally to all native speakers of English as he states. I would suggest that many people do not understand, or think at all, during most of their waking life, but rather work via a large system of preprogrammed reactions, much the way he suggests that the artificial intelligences do not think. How often have you witnessed someone decrying a political standpoint as wrong, or an entire genre of music as poor, merely because they had made the decision in advance? These instances are clearly moments when the understanding mechanism is not engaged. To use a more mundane example, try to recall how often you have heard anyone reply to the ubiquitous query “How are you?” after actually considering the question. This of course raises the question of whether it is possible to distinguish between understanding, and the imitation of understanding. I put forward the following thought experiment: at a cocktail party there are two discussions going on, each one dominated by a single person. In one discussion, the dominating person is a scholar of some particular field. In the other discussion the discussion is dominated by someone who has no so-called “understanding” of the topic, but has spent a sufficient amount of time around scholars of this particular field that they are able to imitate the behavior and speech of a scholar. So much so, that they have a sufficiently rich repertoire of responses to queries that any question we might pose is met with an answer which is thought provoking, and seemingly thoughtful. In a strictly scholarly context, we would label the latter person a plagiarist, rather than a scholar, but how would we ever be able to determine that?",
    "arxivId": "1311.2912",
    "authors": [
        {
            "authorId": "30604277",
            "name": "M. Laufer",
            "url": "https://www.semanticscholar.org/author/30604277"
        }
    ],
    "citationVelocity": 0,
    "citations": [
        {
            "arxivId": null,
            "authors": [
                {
                    "authorId": "81258052",
                    "name": "E. Paz Soldán"
                },
                {
                    "authorId": "2069585931",
                    "name": "J. Powell"
                }
            ],
            "doi": "10.5040/9781350088719.0133",
            "intent": [],
            "isInfluential": false,
            "paperId": "349cb0849eb946dbd0120dae9f624cf3378100ec",
            "title": "Artificial",
            "url": "https://www.semanticscholar.org/paper/349cb0849eb946dbd0120dae9f624cf3378100ec",
            "venue": "Definitions",
            "year": 2015
        },
        {
            "arxivId": "1311.0716",
            "authors": [
                {
                    "authorId": "30604277",
                    "name": "M. Laufer"
                }
            ],
            "doi": null,
            "intent": [],
            "isInfluential": false,
            "paperId": "21a4aef262a09d2631e4ee42de02af92972dc58d",
            "title": "Artificial Intelligence in Humans",
            "url": "https://www.semanticscholar.org/paper/21a4aef262a09d2631e4ee42de02af92972dc58d",
            "venue": "ArXiv",
            "year": 2013
        }
    ],
    "corpusId": 31947889,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 2,
    "numCiting": 0,
    "paperId": "fffb54b17e2891eb9f062fd4da584c651a52ff8d",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        }
    ],
    "title": "A Misanthropic Reinterpretation of the Chinese Room Problem",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/fffb54b17e2891eb9f062fd4da584c651a52ff8d",
    "venue": "arXiv.org",
    "year": 2013
}