{
    "abstract": "This document entails a progressive report on the design and implementation of a bus tracking and monitoring system . This report has its contents within the limits of five chapters with each concisely exploring their various objectives. Chapter one is the introductory chapter. It entails a brief description of a bus tracking and monitoring system ,the need and the aims and objectives of this project. Chapter two consists the literature review of this project. This entails the critical analysis of previous related research and projects undertaken by other people. The merits and demerits of the various implementations.Chapter three consists of theory and design considerations of the proposed system for Kwame Nkrumah University campus. Chapter four talks about the methods used to collect data and the approach and technology stack adopted to build the proposed system.Chapter five concludes the thesis and discusses the results of test and deployment of the proposed system on Kwame Nkrumah University of Science and Technology campus",
    "arxivId": "2101.07674",
    "authors": [
        {
            "authorId": "2047034529",
            "name": "Appau Ernest",
            "url": "https://www.semanticscholar.org/author/2047034529"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 231639399,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "d85df1fc1726e65e50ba9860d9501008860298cb",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "title": "An Artificial Intelligence based approach to estimating time of arrival and bus occupancy for public transport systems in Africa",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/d85df1fc1726e65e50ba9860d9501008860298cb",
    "venue": "arXiv.org",
    "year": 2021
}