{
    "abstract": ": In August of 2021, the Santa Fe Institute hosted a workshop on collective intelligence as part of its Foundations of Intelligence project. This project seeks to advance the ﬁeld of artiﬁcial intelligence by promoting interdisciplinary research on the nature of intelligence. The workshop brought together computer scientists, biologists, philosophers, social scientists, and others to share their insights about how intelligence can emerge from interactions among multiple agents—whether those agents be machines, animals, or human beings. In this report, we summarize each of the talks and the subsequent discussions. We also draw out a number of key themes and identify important frontiers for future research. Melanie Mitchell presented her “Copycat” architecture as a model of collective intelligence. Copycat is a model of abstract perception and analogy making inspired by the kind of collective information processing found in natural systems (e.g., insect colonies, cells, or immune systems). Copycat operates on the domain of letter string analogies . Solving these analogies requires one to identify the rule used to transform one string into another and apply that rule to a new string. For example, if one is shown ”abc → aabbcc” and asked to complete “def → ”, one would complete the string with “ddeeﬀ”. Of course, the rules may also be applied to groups of characters and may include more complicated operations than duplication. For example, “abcdef → cbafed” requires one to realize that the ﬁrst three and last three letters should be treated as separate sequences and individually reversed. This ﬂexibility with respect to grouping and rules makes solving letter string analogies a surprisingly subtle and challenging task. Jessica Flack outlined the ﬁeld of collective computation and its relationship to the kinds of problems discussed in collective intelligence. Most broadly, she contends, the study of collective phenomena is the study of pattern formation in many-body systems. This study encompasses many disciplines, ranging from theoretical computer science, to biology, to statistical mechanics. Within this larger area of research, the study of collective computation aims to (i) ﬁnd common principles underlying diverse examples of collective computation, (ii) provide an organizing framework for relevant sciences, and (iii) develop a general theoretical formalism for characterizing collective computation. James Marshall explored the ways natural and artiﬁcial populations of information-accumulating agents solve decision problems under diﬀering conditions and capabilities. Two salient points from his talk are (i) that the misapplication of decision theory can lead to failed predictions or bad decisions, and (ii) that the simple, elegant decision-making strategies of neurons, honey bees, and collections of robots share important similarities and can enable eﬀective collective decisions in a variety of real-world problems. The talk started with an illustration of how collective decisions can be made by a population of neurons in a mammalian brain. A monkey or a human is shown a ﬁeld of moving dots on a screen. Some of the dots on the screen are moving in the same direction while the rest are moving randomly, such that the ﬁeld displays coherent but noisy motion. The population of neurons must then decide if the majority of dots are generally moving left or right. The statistically optimal solution to this decision problem can be modeled simply and demonstrates a speed-accuracy trade-oﬀ based on Brownian motion toward each of the two possible events, with a decision made based on the log likelihood of each event. An important component of the neural behavior in this system is mutual inhibition; neurons from one population (e.g., those voting for dots moving left) will proportionally inhibit neurons from the other population (voting for dots moving right). This balanced mutual inhibition model also explains other collective decision-making processes, particularly colonies of ants and bees that accumulate evidence and then make a collective decision that all agents then follow. In a manner similar to neurons, honey bees make decisions as competing of evidence-accumulators. The theoretical suggested that in order to optimally trade oﬀ speed and accuracy in choosing a hive site, bees engaged in a waggle dance require a method of",
    "arxivId": "2112.06864",
    "authors": [
        {
            "authorId": "51258947",
            "name": "Tyler Millhouse",
            "url": "https://www.semanticscholar.org/author/51258947"
        },
        {
            "authorId": "2052750",
            "name": "M. Moses",
            "url": "https://www.semanticscholar.org/author/2052750"
        },
        {
            "authorId": "71370384",
            "name": "M. Mitchell",
            "url": "https://www.semanticscholar.org/author/71370384"
        }
    ],
    "citationVelocity": 0,
    "citations": [
        {
            "arxivId": "2304.05147",
            "authors": [
                {
                    "authorId": "151482236",
                    "name": "Roberto Casadei"
                }
            ],
            "doi": "10.1162/artl_a_00408",
            "intent": [
                "background"
            ],
            "isInfluential": false,
            "paperId": "dcfd1ae5a2ce484c687a21fa0dbe19fbb56dec1c",
            "title": "Artificial Collective Intelligence Engineering: A Survey of Concepts and Perspectives",
            "url": "https://www.semanticscholar.org/paper/dcfd1ae5a2ce484c687a21fa0dbe19fbb56dec1c",
            "venue": "Artificial Life",
            "year": 2023
        },
        {
            "arxivId": null,
            "authors": [
                {
                    "authorId": "2276894",
                    "name": "Yuxi Li"
                }
            ],
            "doi": null,
            "intent": [
                "background"
            ],
            "isInfluential": false,
            "paperId": "8c8868d75f5fc7a055fdbc8610ab20b0a4304829",
            "title": "Deep Reinforcement Learning: Opportunities and Challenges",
            "url": "https://www.semanticscholar.org/paper/8c8868d75f5fc7a055fdbc8610ab20b0a4304829",
            "venue": "ArXiv",
            "year": 2022
        }
    ],
    "corpusId": 245124352,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 2,
    "numCiting": 7,
    "paperId": "728b3198f250aed5b06b872beb9360d16bfc0846",
    "references": [
        {
            "arxivId": null,
            "authors": [
                {
                    "authorId": "144410906",
                    "name": "A. Ferguson"
                }
            ],
            "doi": "10.1017/cbo9780511806599",
            "intent": [
                "background"
            ],
            "isInfluential": false,
            "paperId": "898042aa27883c3c1a3a83d4a1ccfa82bfaa735c",
            "title": "An Essay on the History of Civil Society",
            "url": "https://www.semanticscholar.org/paper/898042aa27883c3c1a3a83d4a1ccfa82bfaa735c",
            "venue": "",
            "year": 2019
        },
        {
            "arxivId": "1711.00088",
            "authors": [
                {
                    "authorId": "3438473",
                    "name": "Max H. Quinn"
                },
                {
                    "authorId": "27572284",
                    "name": "E. Conser"
                },
                {
                    "authorId": "38602893",
                    "name": "Jordan M. Witte"
                },
                {
                    "authorId": "144380037",
                    "name": "Melanie Mitchell"
                }
            ],
            "doi": "10.1109/ICSC.2018.00032",
            "intent": [],
            "isInfluential": false,
            "paperId": "25894be540936562953f37fbbcff69e5ac17a494",
            "title": "Semantic Image Retrieval via Active Grounding of Visual Situations",
            "url": "https://www.semanticscholar.org/paper/25894be540936562953f37fbbcff69e5ac17a494",
            "venue": "2018 IEEE 12th International Conference on Semantic Computing (ICSC)",
            "year": 2017
        },
        {
            "arxivId": null,
            "authors": [
                {
                    "authorId": "2225463",
                    "name": "E. Koutsoupias"
                },
                {
                    "authorId": "144102674",
                    "name": "C. Papadimitriou"
                }
            ],
            "doi": "10.1016/j.cosrev.2009.04.003",
            "intent": [
                "background"
            ],
            "isInfluential": false,
            "paperId": "3ae866f55cebbffe18d07c27d7d5fd1b7dea6e14",
            "title": "Worst-case Equilibria",
            "url": "https://www.semanticscholar.org/paper/3ae866f55cebbffe18d07c27d7d5fd1b7dea6e14",
            "venue": "STACS",
            "year": 1999
        },
        {
            "arxivId": null,
            "authors": [
                {
                    "authorId": "2991091",
                    "name": "H. Morowitz"
                }
            ],
            "doi": "10.4324/9780429492761",
            "intent": [
                "background"
            ],
            "isInfluential": false,
            "paperId": "030d39372624f731770e2f75a4e51b6017a60cd5",
            "title": "The Mind, the Brain, and Complex Adaptive Systems",
            "url": "https://www.semanticscholar.org/paper/030d39372624f731770e2f75a4e51b6017a60cd5",
            "venue": "",
            "year": 1995
        },
        {
            "arxivId": null,
            "authors": [
                {
                    "authorId": "145472907",
                    "name": "R. MacIntosh"
                },
                {
                    "authorId": "46588604",
                    "name": "D. Maclean"
                }
            ],
            "doi": "10.4135/9781412956246.n78",
            "intent": [],
            "isInfluential": false,
            "paperId": "4a1d73e4c4ad2261963084db9fb2033504e1135c",
            "title": "Complex adaptive systems",
            "url": "https://www.semanticscholar.org/paper/4a1d73e4c4ad2261963084db9fb2033504e1135c",
            "venue": "",
            "year": 1992
        }
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        }
    ],
    "title": "Frontiers in Collective Intelligence: A Workshop Report",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/728b3198f250aed5b06b872beb9360d16bfc0846",
    "venue": "arXiv.org",
    "year": 2021
}