{
    "abstract": "The goal of building dialogue agents that can converse with humans naturally has been a long-standing dream of researchers since the early days of artificial intelligence. The well-known Turing Test proposed to judge the ultimate validity of an artificial intelligence agent on the indistinguishability of its dialogues from humans'. It should come as no surprise that human-level dialogue systems are very challenging to build. But, while early effort on rule-based systems found limited success, the emergence of deep learning enabled great advance on this topic. In this thesis, we focus on methods that address the numerous issues that have been imposing the gap between artificial conversational agents and human-level interlocutors. These methods were proposed and experimented with in ways that were inspired by general state-of-the-art AI methodologies. But they also targeted the characteristics that dialogue systems possess.",
    "arxivId": "2212.03279",
    "authors": [
        {
            "authorId": "2061649994",
            "name": "Tom Young",
            "url": "https://www.semanticscholar.org/author/2061649994"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 254366578,
    "doi": "10.48550/arXiv.2212.03279",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": true,
    "isPublisherLicensed": true,
    "is_open_access": true,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "0f32b8bf501343adf3f2cbc0fcce82c23bb92e8a",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "From Knowledge Augmentation to Multi-tasking: Towards Human-like Dialogue Systems",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/0f32b8bf501343adf3f2cbc0fcce82c23bb92e8a",
    "venue": "arXiv.org",
    "year": 2022
}