{
    "abstract": "Modern civilian and military systems have created a demand for sophisticated intelligent autonomous machines capable of operating in uncertain dynamic environments. Such systems are realizable thanks in large part to major advances in perception and decision-making techniques, which in turn have been propelled forward by modern machine learning tools. However, these newer forms of intelligent autonomy raise questions about when/how communication of the operational intent and assessments of actual vs. supposed capabilities of autonomous agents impact overall performance. This symposium examines the possibilities for enabling intelligent autonomous systems to self-assess and communicate their ability to effectively execute assigned tasks, as well as reason about the overall limits of their competencies and maintain operability within those limits. The symposium brings together researchers working in this burgeoning area of research to share lessons learned, identify major theoretical and practical challenges encountered so far, and potential avenues for future research and real-world applications.",
    "arxivId": "2301.05384",
    "authors": [
        {
            "authorId": "2148705582",
            "name": "Nicholas Conlon",
            "url": "https://www.semanticscholar.org/author/2148705582"
        },
        {
            "authorId": "95093910",
            "name": "Aastha Acharya",
            "url": "https://www.semanticscholar.org/author/95093910"
        },
        {
            "authorId": "35265121",
            "name": "nisar. ahmed",
            "url": "https://www.semanticscholar.org/author/35265121"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 255825856,
    "doi": "10.48550/arXiv.2301.05384",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": true,
    "isPublisherLicensed": true,
    "is_open_access": true,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "6c7b6b46be63dba52869ad35904abdbcd46612a9",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "AAAI 2022 Fall Symposium: Lessons Learned for Autonomous Assessment of Machine Abilities (LLAAMA)",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/6c7b6b46be63dba52869ad35904abdbcd46612a9",
    "venue": "arXiv.org",
    "year": 2023
}