{
    "abstract": "Is the rapid adoption of Artificial Intelligence a sign that creative destruction (a capitalist innovation process first theorised in 1942) is occurring? Although its theory suggests that it is only visible over time in aggregate, this paper devises three hypotheses to test its presence on a macro level and research methods to produce the required data. This paper tests the theory using news archives, questionnaires, and interviews with industry professionals. It considers the risks of adopting Artificial Intelligence, its current performance in the market and its general applicability to the role. The results suggest that creative destruction is occurring in the AML industry despite the activities of the regulators acting as natural blockers to innovation. This is a pressurised situation where current-generation Artificial Intelligence may offer more harm than benefit. For managers, this papers results suggest that safely pursuing AI in AML requires having realistic expectations of Artificial Intelligence's benefits combined with using a framework for AI Ethics.",
    "arxivId": "2302.13823",
    "authors": [
        {
            "authorId": "83399306",
            "name": "J. Bell",
            "url": "https://www.semanticscholar.org/author/83399306"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 257220074,
    "doi": null,
    "fieldsOfStudy": [
        "Economics"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "d645cffcd56011d957be8d57cefa85471772637e",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Economics",
            "source": "external"
        },
        {
            "category": "Economics",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "The global economic impact of AI technologies in the fight against financial crime",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/d645cffcd56011d957be8d57cefa85471772637e",
    "venue": "",
    "year": 2023
}