{
    "abstract": "This study presents an ensemble approach that addresses the challenges of identification and analysis of research articles in rapidly evolving fields, using the field of Artificial Intelligence (AI) as a case study. Our approach included using decision tree, sciBERT and regular expression matching on different fields of the articles, and a SVM to merge the results from different models. We evaluated the effectiveness of our method on a manually labeled dataset, finding that our combined approach captured around 97% of AI-related articles in the web of science (WoS) corpus with a precision of 0.92. This presents a 0.15 increase in F1 score compared with existing search term based approach. Following this, we analyzed the publication volume trends and common research themes.We found that compared with existing methods, our ensemble approach revealed an increased degree of interdisciplinarity, and was able to identify more articles in certain subfields like feature extraction and optimization. This study demonstrates the potential of our approach as a tool for the accurate identification of scholarly articles, which is also capable of providing insights into the volume and content of a research area.",
    "arxivId": "2304.09487",
    "authors": [
        {
            "authorId": "2214791310",
            "name": "Lie Tang",
            "url": "https://www.semanticscholar.org/author/2214791310"
        },
        {
            "authorId": "2215796805",
            "name": "Xian Zhou",
            "url": "https://www.semanticscholar.org/author/2215796805"
        },
        {
            "authorId": "2214865316",
            "name": "Min Lu",
            "url": "https://www.semanticscholar.org/author/2214865316"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 260316029,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "59b4742f8460f3aab7490c91bc509a94454b0d53",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "An Ensemble Approach for Research Article Identification: a Case Study in Artificial Intelligence",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/59b4742f8460f3aab7490c91bc509a94454b0d53",
    "venue": "",
    "year": 2023
}