{
    "abstract": "This paper proposes a new cognitive model, acting as the main component of an AGI agent. The model is introduced in its mature intelligence state, and as an extension of previous models, DENN, and especially AKREM, by including operational models (frames/classes) and will. This model's core assumption is that cognition is about operating on accumulated knowledge, with the guidance of an appropriate will. Also, we assume that the actions, part of knowledge, are learning to be aligned with will, during the evolution phase that precedes the mature intelligence state. In addition, this model is mainly based on the duality principle in every known intelligent aspect, such as exhibiting both top-down and bottom-up model learning, generalization verse specialization, and more. Furthermore, a holistic approach is advocated for AGI designing, and cognition under constraints or efficiency is proposed, in the form of reusability and simplicity. Finally, reaching this mature state is described via a cognitive evolution from infancy to adulthood, utilizing a consolidation principle. The final product of this cognitive model is a dynamic operational memory of models and instances. Lastly, some examples and preliminary ideas for the evolution phase to reach the mature state are presented.",
    "arxivId": "2308.04600",
    "authors": [
        {
            "authorId": "1395873801",
            "name": "Shimon Komarovsky",
            "url": "https://www.semanticscholar.org/author/1395873801"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 260735913,
    "doi": "10.48550/arXiv.2308.04600",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": true,
    "isPublisherLicensed": true,
    "is_open_access": true,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "75871df9a1ebdfad1321a7f8154c695187445001",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "Model of models - Part 1",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/75871df9a1ebdfad1321a7f8154c695187445001",
    "venue": "arXiv.org",
    "year": 2023
}