{
    "abstract": "This paper provides an overview of the intricate relationship between social dynamics, technological advancements, and pioneering figures in the fields of cybernetics and artificial intelligence. It explores the impact of collaboration and interpersonal relationships among key scientists, such as McCulloch, Wiener, Pitts, and Rosenblatt, on the development of cybernetics and neural networks. It also discusses the contested attribution of credit for important innovations like the backpropagation algorithm and the potential consequences of unresolved debates within emerging scientific domains. It emphasizes how interpretive flexibility, public perception, and the influence of prominent figures can shape the trajectory of a new field. It highlights the role of funding, media attention, and alliances in determining the success and recognition of various research approaches. Additionally, it points out the missed opportunities for collaboration and integration between symbolic AI and neural network researchers, suggesting that a more unified approach may be possible in today's era without the historical baggage of past debates.",
    "arxivId": "2311.10097",
    "authors": [
        {
            "authorId": "2264337927",
            "name": "Benji Alwis",
            "url": "https://www.semanticscholar.org/author/2264337927"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 265281282,
    "doi": "10.48550/arXiv.2311.10097",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "ca8fb797044d45a12f34f04e116a56b52ea6e5dc",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "History",
            "source": "s2-fos-model"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        }
    ],
    "title": "Investigating AI's Challenges in Reasoning and Explanation from a Historical Perspective",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/ca8fb797044d45a12f34f04e116a56b52ea6e5dc",
    "venue": "arXiv.org",
    "year": 2023
}