{
    "abstract": "This thesis delves into a fortiori arguments in deductive reasoning, underscoring their relevance in various domains such as law, philosophy, and artificial intelligence. The research is centred on employing GPT-3.5-turbo to automate the analysis of these arguments, with a focus on understanding intricate reasoning processes, generating clear and coherent explanations, and creating novel arguments. The methodology encompasses a series of tasks including detailed reasoning, interpretation, and the augmentation of a fortiori arguments. It involves meticulously identifying these arguments in diverse contexts, differentiating comparative elements, and categorizing them based on their logical structure. Extensive experiments reveals the challenges encountered by GPT-3.5-turbo in accurately detecting and classifying a fortiori arguments. Nevertheless, the model demonstrates a performance that rivals specialized models, particularly in extracting key components and interpreting underlying properties. The integration of external information into the model's processing significantly elevates the quality of the generated explanations. Additionally, the model exhibits a noteworthy capability in augmenting arguments, thus contributing to the enrichment of the data set. Despite facing certain limitations, this thesis makes significant contributions to the fields of artificial intelligence and logical reasoning. It introduces novel methodologies, establishes a rigorous evaluation framework, and provides deep insights that set the stage for future advancements in automated logical reasoning. The findings and methodologies presented herein not only underscore the potential of AI in complex reasoning tasks but also highlight areas for future research and development.",
    "arxivId": "2311.13455",
    "authors": [
        {
            "authorId": "2267723595",
            "name": "Yanyi Pu",
            "url": "https://www.semanticscholar.org/author/2267723595"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 265351477,
    "doi": "10.48550/arXiv.2311.13455",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "861262c138f6b76d98473c7373a27dc9b2096e18",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        },
        {
            "category": "Law",
            "source": "s2-fos-model"
        }
    ],
    "title": "Generation of Explanations for Logic Reasoning",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/861262c138f6b76d98473c7373a27dc9b2096e18",
    "venue": "arXiv.org",
    "year": 2023
}