{
    "abstract": "Managing project risk is a key part of the successful implementation of any large project and is widely recognized as a best practice for public agencies to deliver infrastructures. The conventional method of identifying and evaluating project risks involves getting input from subject matter experts at risk workshops in the early phases of a project. As a project moves through its life cycle, these identified risks and their assessments evolve. Some risks are realized to become issues, some are mitigated, and some are retired as no longer important. Despite the value provided by conventional expert-based approaches, several challenges remain due to the time-consuming and expensive processes involved. Moreover, limited is known about how risks evolve from ex-ante to ex-post over time. How well does the project team identify and evaluate risks in the initial phase compared to what happens during project execution? Using historical data and artificial intelligence techniques, this study addressed these limitations by introducing a data-driven framework to identify risks automatically and to examine the quality of early risk registers and risk assessments. Risk registers from more than 70 U.S. major transportation projects form the input dataset.",
    "arxivId": "2311.14203",
    "authors": [
        {
            "authorId": "2049797954",
            "name": "Abdolmajid Erfani",
            "url": "https://www.semanticscholar.org/author/2049797954"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 265445490,
    "doi": "10.48550/arXiv.2311.14203",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "752ee32953287c138e13412e8efff47b06f9592d",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "Data-Driven Risk Modeling for Infrastructure Projects Using Artificial Intelligence Techniques",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/752ee32953287c138e13412e8efff47b06f9592d",
    "venue": "arXiv.org",
    "year": 2023
}