{
    "abstract": "Explainable artificial intelligence (XAI) aims to develop transparent explanatory approaches for\"black-box\"deep learning models. However,it remains difficult for existing methods to achieve the trade-off of the three key criteria in interpretability, namely, reliability, causality, and usability, which hinder their practical applications. In this paper, we propose a self-supervised automatic semantic interpretable explainable artificial intelligence (AS-XAI) framework, which utilizes transparent orthogonal embedding semantic extraction spaces and row-centered principal component analysis (PCA) for global semantic interpretation of model decisions in the absence of human interference, without additional computational costs. In addition, the invariance of filter feature high-rank decomposition is used to evaluate model sensitivity to different semantic concepts. Extensive experiments demonstrate that robust and orthogonal semantic spaces can be automatically extracted by AS-XAI, providing more effective global interpretability for convolutional neural networks (CNNs) and generating human-comprehensible explanations. The proposed approach offers broad fine-grained extensible practical applications, including shared semantic interpretation under out-of-distribution (OOD) categories, auxiliary explanations for species that are challenging to distinguish, and classification explanations from various perspectives.",
    "arxivId": "2312.14935",
    "authors": [
        {
            "authorId": "2269485604",
            "name": "Changqi Sun",
            "url": "https://www.semanticscholar.org/author/2269485604"
        },
        {
            "authorId": "2276525338",
            "name": "Hao Xu",
            "url": "https://www.semanticscholar.org/author/2276525338"
        },
        {
            "authorId": "47557829",
            "name": "Yuntian Chen",
            "url": "https://www.semanticscholar.org/author/47557829"
        },
        {
            "authorId": "2109543832",
            "name": "Dong-juan Zhang",
            "url": "https://www.semanticscholar.org/author/2109543832"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 266551458,
    "doi": "10.48550/arXiv.2312.14935",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "4e44c874a487252b51e48970999dde21d68d94d0",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "AS-XAI: Self-supervised Automatic Semantic Interpretation for CNN",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/4e44c874a487252b51e48970999dde21d68d94d0",
    "venue": "arXiv.org",
    "year": 2023
}