{
    "abstract": "This review aims to contribute to the quest for artificial general intelligence by examining neuroscience and cognitive psychology methods for potential inspiration. Despite the impressive advancements achieved by deep learning models in various domains, they still have shortcomings in abstract reasoning and causal understanding. Such capabilities should be ultimately integrated into artificial intelligence systems in order to surpass data-driven limitations and support decision making in a way more similar to human intelligence. This work is a vertical review that attempts a wide-ranging exploration of brain function, spanning from lower-level biological neurons, spiking neural networks, and neuronal ensembles to higher-level concepts such as brain anatomy, vector symbolic architectures, cognitive and categorization models, and cognitive architectures. The hope is that these concepts may offer insights for solutions in artificial general intelligence.",
    "arxivId": "2401.10904",
    "authors": [
        {
            "authorId": "2280146272",
            "name": "Florin Leon",
            "url": "https://www.semanticscholar.org/author/2280146272"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 267068839,
    "doi": "10.48550/arXiv.2401.10904",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "14909e6dd163a98687cd29042c26e34c2f78de4e",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "title": "A Review of Findings from Neuroscience and Cognitive Psychology as Possible Inspiration for the Path to Artificial General Intelligence",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/14909e6dd163a98687cd29042c26e34c2f78de4e",
    "venue": "arXiv.org",
    "year": 2024
}