{
    "abstract": "Since the key to artificial general intelligence (AGI) is commonly believed to be commonsense reasoning (CSR) or, roughly equivalently, discovery of a knowledge representation method (KRM) that is particularly suitable for CSR, the author developed a custom KRM for CSR. This novel KRM called Tumbug was designed to be pictorial in nature because there exists increasing evidence that the human brain uses some pictorial type of KRM, and no well-known prior research in AGI has researched this KRM possibility. Tumbug is somewhat similar to Roger Schank's Conceptual Dependency (CD) theory, but Tumbug is pictorial and uses about 30 components based on fundamental concepts from the sciences and human life, in contrast to CD theory, which is textual and uses about 17 components (= 6 Primitive Conceptual Categories + 11 Primitive Acts) based mainly on human-oriented activities. All the Building Blocks of Tumbug were found to generalize to only five Basic Building Blocks that exactly correspond to the three components {O, A, V} of traditional Object-Attribute-Value representation plus two new components {C, S}, which are Change and System. Collectively this set of five components, called\"SCOVA,\"seems to be a universal foundation for all knowledge representation.",
    "arxivId": "2401.09448",
    "authors": [
        {
            "authorId": "2279831943",
            "name": "Mark A. Atkins",
            "url": "https://www.semanticscholar.org/author/2279831943"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 267035096,
    "doi": "10.48550/arXiv.2401.09448",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "70f90c4c5598e005aaf42316fa747372b0b9cb09",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        }
    ],
    "title": "Tumbug: A pictorial, universal knowledge representation method",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/70f90c4c5598e005aaf42316fa747372b0b9cb09",
    "venue": "arXiv.org",
    "year": 2023
}