{
    "abstract": "Entity and relationship extraction is a crucial component in natural language processing tasks such as knowledge graph construction, question answering system design, and semantic analysis. Most of the information of the Yishui school of traditional Chinese Medicine (TCM) is stored in the form of unstructured classical Chinese text. The key information extraction of TCM texts plays an important role in mining and studying the academic schools of TCM. In order to solve these problems efficiently using artificial intelligence methods, this study constructs a word segmentation and entity relationship extraction model based on conditional random fields under the framework of natural language processing technology to identify and extract the entity relationship of traditional Chinese medicine texts, and uses the common weighting technology of TF-IDF information retrieval and data mining to extract important key entity information in different ancient books. The dependency syntactic parser based on neural network is used to analyze the grammatical relationship between entities in each ancient book article, and it is represented as a tree structure visualization, which lays the foundation for the next construction of the knowledge graph of Yishui school and the use of artificial intelligence methods to carry out the research of TCM academic schools.",
    "arxivId": "2402.10743",
    "authors": [
        {
            "authorId": "2284724805",
            "name": "Hanqing Zhao",
            "url": "https://www.semanticscholar.org/author/2284724805"
        },
        {
            "authorId": "2284814734",
            "name": "Yuehan Li",
            "url": "https://www.semanticscholar.org/author/2284814734"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 267740246,
    "doi": "10.48550/arXiv.2402.10743",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "5ef222dc12a586c556b46c0c61eededb5e84de2d",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "title": "Construction of a Syntactic Analysis Map for Yi Shui School through Text Mining and Natural Language Processing Research",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/5ef222dc12a586c556b46c0c61eededb5e84de2d",
    "venue": "arXiv.org",
    "year": 2024
}