{
    "abstract": "In the present research, we delve into the intricate realm of electroencephalogram (EEG) data analysis, focusing on sequence-to-sequence prediction of data across 32 EEG channels. The study harmoniously fuses the principles of applied chaos theory and dynamical systems theory to engender a novel feature set, enriching the representational capacity of our deep learning model. The endeavour's cornerstone is a transformer-based sequence-to-sequence architecture, calibrated meticulously to capture the non-linear and high-dimensional temporal dependencies inherent in EEG sequences. Through judicious architecture design, parameter initialisation strategies, and optimisation techniques, we have navigated the intricate balance between computational expediency and predictive performance. Our model stands as a vanguard in EEG data sequence prediction, demonstrating remarkable generalisability and robustness. The findings not only extend our understanding of EEG data dynamics but also unveil a potent analytical framework that can be adapted to diverse temporal sequence prediction tasks in neuroscience and beyond.",
    "arxivId": "2402.03316",
    "authors": [
        {
            "authorId": "2311506229",
            "name": "Vincent Jorgsson",
            "url": "https://www.semanticscholar.org/author/2311506229"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 267500168,
    "doi": "10.13140/RG.2.2.30204.51849",
    "fieldsOfStudy": [
        "Biology",
        "Computer Science",
        "Mathematics",
        "Physics"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "9397a6cd447f362fe4b5e764997dcded3828fa71",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "title": "Artificial Intelligence for EEG Prediction: Applied Chaos Theory",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/9397a6cd447f362fe4b5e764997dcded3828fa71",
    "venue": "",
    "year": 2023
}