{
    "abstract": "Artificial intelligence (AI), although not able to currently capture the many complexities of humans, are slowly adapting to have certain capabilities of humans, many of which can revolutionize our world. AI systems, such as ChatGPT and others utilized within various industries for specific processes, have been transforming rapidly. However, this transformation can occur in an extremely concerning way if certain measures are not taken. This article touches on some of the current issues within the artificial intelligence ethical crisis, such as the concerns of discrimination within AI and false information that is becoming readily available with AI. Within this article, plausible solutions involving regulation are discussed and how they would mitigate ethical concerns. These include the self-regulation of businesses along with government regulation, and the effects these possible solutions can both have on current AI concerns.",
    "arxivId": "2403.15507",
    "authors": [
        {
            "authorId": "2293311471",
            "name": "Jay Nemec",
            "url": "https://www.semanticscholar.org/author/2293311471"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 268680378,
    "doi": "10.48550/arXiv.2403.15507",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "3ae5d40c4e65cdaa6ea2ff3a6798f743c8aafdfd",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Law",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "Analyzing Potential Solutions Involving Regulation to Escape Some of AI's Ethical Concerns",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/3ae5d40c4e65cdaa6ea2ff3a6798f743c8aafdfd",
    "venue": "arXiv.org",
    "year": 2024
}