{
    "abstract": "Globally, artificial intelligence (AI) implementation is growing, holding the capability to fundamentally alter organisational processes and decision making. Simultaneously, this brings a multitude of emergent risks to organisations, exposing vulnerabilities in their extant risk management frameworks. This necessitates a greater understanding of how organisations can position themselves in response. This issue is particularly pertinent within the financial sector with relatively mature AI applications matched with severe societal repercussions of potential risk events. Despite this, academic risk management literature is trailing behind the speed of AI implementation. Adopting a management perspective, this study aims to contribute to the understanding of AI risk management in organisations through an exploratory empirical investigation into these practices. In-depth insights are gained through interviews with nine practitioners from different organisations within the UK financial sector. Through examining areas of organisational convergence and divergence, the findings of this study unearth levels of risk management framework readiness and prevailing approaches to risk management at both a processual and organisational level. Whilst enhancing the developing literature concerning AI risk management within organisations, the study simultaneously offers a practical contribution, providing key areas of guidance for practitioners in the operational development of AI risk management frameworks.",
    "arxivId": "2404.05847",
    "authors": [
        {
            "authorId": "2295731079",
            "name": "Finlay McGee",
            "url": "https://www.semanticscholar.org/author/2295731079"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 269009768,
    "doi": "10.48550/arXiv.2404.05847",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "7fc3d1d7037836b1a8c29a0f744010ddf95d1cf3",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Business",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "Approaching Emergent Risks: An Exploratory Study into Artificial Intelligence Risk Management within Financial Organisations",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/7fc3d1d7037836b1a8c29a0f744010ddf95d1cf3",
    "venue": "arXiv.org",
    "year": 2024
}