{
    "abstract": "The advancement in technology has made interdisciplinary research more accessible. Particularly the breakthrough in Artificial Intelligence AI has given huge advantages to researchers working in interdisciplinary and multidisciplinary fields. This study investigates the ability of AI models, particularly GPT4 and GPT Data Analyst in creating language maps for language documentation. The study Integrates documentary linguistics linguistic geography and AI by showcasing how AI models facilitate the spatial documentation of languages through the creation of language maps with minimal cartographic expertise. The study is conducted using a CSV file and a GeoJSON file both obtained from HDX and from the researchers fieldwork. The study data is then applied in realtime conversations with the AI models in order to generate the language distribution maps. The study highlights the two AI models capabilities in generating highquality static and interactive web maps and streamlining the mapmaking process, despite facing challenges like inconsistencies and difficulties in adding legends. The findings suggest a promising future for AI in generating language maps and enhancing the work of documentary linguists as they collect their data in the field pointing towards the need for further development to fully harness AI potential in this field.",
    "arxivId": "2404.01263",
    "authors": [
        {
            "authorId": "2294575421",
            "name": "Hakam Ghanim",
            "url": "https://www.semanticscholar.org/author/2294575421"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 268857206,
    "doi": "10.48550/arXiv.2404.01263",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 3,
    "paperId": "dafe8c0e9f5451a25b366aaa4388321966529018",
    "references": [
        {
            "arxivId": null,
            "authors": [
                {
                    "authorId": "40229068",
                    "name": "Andreas W. Neumann"
                }
            ],
            "doi": "10.1007/978-0-387-35973-1_1485",
            "intent": [],
            "isInfluential": false,
            "paperId": "6ea56adc1b87181ea250b8302a3ff79c2b03b444",
            "title": "Web Mapping and Web Cartography",
            "url": "https://www.semanticscholar.org/paper/6ea56adc1b87181ea250b8302a3ff79c2b03b444",
            "venue": "Encyclopedia of GIS",
            "year": 2008
        }
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        }
    ],
    "title": "Artificial Intelligence and the Spatial Documentation of Languages",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/dafe8c0e9f5451a25b366aaa4388321966529018",
    "venue": "arXiv.org",
    "year": 2024
}