{
    "abstract": "This book critically analyses the value of citation data, altmetrics, and artificial intelligence to support the research evaluation of articles, scholars, departments, universities, countries, and funders. It introduces and discusses indicators that can support research evaluation and analyses their strengths and weaknesses as well as the generic strengths and weaknesses of the use of indicators for research assessment. The book includes evidence of the comparative value of citations and altmetrics in all broad academic fields primarily through comparisons against article level human expert judgements from the UK Research Excellence Framework 2021. It also discusses the potential applications of traditional artificial intelligence and large language models for research evaluation, with large scale evidence for the former. The book concludes that citation data can be informative and helpful in some research fields for some research evaluation purposes but that indicators are never accurate enough to be described as research quality measures. It also argues that AI may be helpful in limited circumstances for some types of research evaluation.",
    "arxivId": "2407.00135",
    "authors": [
        {
            "authorId": "2271968591",
            "name": "Mike Thelwall",
            "url": "https://www.semanticscholar.org/author/2271968591"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 270870060,
    "doi": "10.48550/arXiv.2407.00135",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "225974bf7ffbddd42a0823fb702f0f67fdf35681",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "Quantitative Methods in Research Evaluation Citation Indicators, Altmetrics, and Artificial Intelligence",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/225974bf7ffbddd42a0823fb702f0f67fdf35681",
    "venue": "arXiv.org",
    "year": 2024
}