{
    "abstract": "In an era characterized by rapid societal changes and complex challenges, institutions' traditional methods of problem-solving in the public sector are increasingly proving inadequate. In this study, we present an innovative and effective model for how institutions can use artificial intelligence to enable groups of people to generate effective solutions to urgent problems more efficiently. We describe a proven collective intelligence method, called Smarter Crowdsourcing, which is designed to channel the collective intelligence of those with expertise about a problem into actionable solutions through crowdsourcing. Then we introduce Policy Synth, an innovative toolkit which leverages AI to make the Smarter Crowdsourcing problem-solving approach both more scalable, more effective and more efficient. Policy Synth is crafted using a human-centric approach, recognizing that AI is a tool to enhance human intelligence and creativity, not replace it. Based on a real-world case study comparing the results of expert crowdsourcing alone with expert sourcing supported by Policy Synth AI agents, we conclude that Smarter Crowdsourcing with Policy Synth presents an effective model for integrating the collective wisdom of human experts and the computational power of AI to enhance and scale up public problem-solving processes. While many existing approaches view AI as a tool to make crowdsourcing and deliberative processes better and more efficient, Policy Synth goes a step further, recognizing that AI can also be used to synthesize the findings from engagements together with research to develop evidence-based solutions and policies. The study offers practical tools and insights for institutions looking to engage communities effectively in addressing urgent societal challenges.",
    "arxivId": "2407.13960",
    "authors": [
        {
            "authorId": "2312209442",
            "name": "R'obert Bjarnason",
            "url": "https://www.semanticscholar.org/author/2312209442"
        },
        {
            "authorId": "2312208206",
            "name": "Dane Gambrell",
            "url": "https://www.semanticscholar.org/author/2312208206"
        },
        {
            "authorId": "2312209865",
            "name": "Joshua Lanthier-Welch",
            "url": "https://www.semanticscholar.org/author/2312209865"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 271310347,
    "doi": "10.48550/arXiv.2407.13960",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "2f5f86138234a22e314bd42bc25554cac90ce6f0",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "Using Artificial Intelligence to Accelerate Collective Intelligence: Policy Synth and Smarter Crowdsourcing",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/2f5f86138234a22e314bd42bc25554cac90ce6f0",
    "venue": "arXiv.org",
    "year": 2024
}