{
    "abstract": "Explainable Artificial Intelligence (XAI) is central to the debate on integrating Artificial Intelligence (AI) and Machine Learning (ML) algorithms into clinical practice. High-performing AI/ML models, such as ensemble learners and deep neural networks, often lack interpretability, hampering clinicians' trust in their predictions. To address this, XAI techniques are being developed to describe AI/ML predictions in human-understandable terms. One promising direction is the adaptation of sensitivity analysis (SA) and global sensitivity analysis (GSA), which inherently rank model inputs by their impact on predictions. Here, we introduce a novel delta-XAI method that provides local explanations of ML model predictions by extending the delta index, a GSA metric. The delta-XAI index assesses the impact of each feature's value on the predicted output for individual instances in both regression and classification problems. We formalize the delta-XAI index and provide code for its implementation. The delta-XAI method was evaluated on simulated scenarios using linear regression models, with Shapley values serving as a benchmark. Results showed that the delta-XAI index is generally consistent with Shapley values, with notable discrepancies in models with highly impactful or extreme feature values. The delta-XAI index demonstrated higher sensitivity in detecting dominant features and handling extreme feature values. Qualitatively, the delta-XAI provides intuitive explanations by leveraging probability density functions, making feature rankings clearer and more explainable for practitioners. Overall, the delta-XAI method appears promising for robustly obtaining local explanations of ML model predictions. Further investigations in real-world clinical settings will be conducted to evaluate its impact on AI-assisted clinical workflows.",
    "arxivId": "2407.18343",
    "authors": [
        {
            "authorId": "2313476379",
            "name": "Alessandro De Carlo",
            "url": "https://www.semanticscholar.org/author/2313476379"
        },
        {
            "authorId": "2135731778",
            "name": "Enea Parimbelli",
            "url": "https://www.semanticscholar.org/author/2135731778"
        },
        {
            "authorId": "52212215",
            "name": "N. Melillo",
            "url": "https://www.semanticscholar.org/author/52212215"
        },
        {
            "authorId": "77199223",
            "name": "G. Nicora",
            "url": "https://www.semanticscholar.org/author/77199223"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 271516193,
    "doi": "10.48550/arXiv.2407.18343",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 2,
    "paperId": "211e5ca1be4938053d30930dd33b18392dd54d67",
    "references": [
        {
            "arxivId": null,
            "authors": [
                {
                    "authorId": "101574428",
                    "name": "N. Do"
                },
                {
                    "authorId": "37297407",
                    "name": "S. Razavi"
                }
            ],
            "doi": "10.1029/2019WR025436",
            "intent": [],
            "isInfluential": false,
            "paperId": "143536e2a7929551d9c12ca56c9306b3d2253f4f",
            "title": "Correlation Effects? A Major but Often Neglected Component in Sensitivity and Uncertainty Analysis",
            "url": "https://www.semanticscholar.org/paper/143536e2a7929551d9c12ca56c9306b3d2253f4f",
            "venue": "Water Resources Research",
            "year": 2020
        }
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "title": "Introducing Δ-XAI: a novel sensitivity-based method for local AI explanations",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/211e5ca1be4938053d30930dd33b18392dd54d67",
    "venue": "arXiv.org",
    "year": 2024
}