{
    "abstract": "The United States and China will play an important role in navigating safety and security challenges relating to advanced artificial intelligence. We sought to better understand how experts in each country describe safety and security threats from advanced artificial intelligence, extreme risks from AI, and the potential for international cooperation. Specifically, we compiled publicly-available statements from major technical and policy leaders in both the United States and China. We focused our analysis on advanced forms of artificial intelligence, such as artificial general intelligence (AGI), that may have the most significant impacts on national and global security. Experts in both countries expressed concern about risks from AGI, risks from intelligence explosions, and risks from AI systems that escape human control. Both countries have also launched early efforts designed to promote international cooperation around safety standards and risk management practices. Notably, our findings only reflect information from publicly available sources. Nonetheless, our findings can inform policymakers and researchers about the state of AI discourse in the US and China. We hope such work can contribute to policy discussions around advanced AI, its global security threats, and potential international dialogues or agreements to mitigate such threats.",
    "arxivId": "2407.16903",
    "authors": [
        {
            "authorId": "2264144770",
            "name": "Akash Wasil",
            "url": "https://www.semanticscholar.org/author/2264144770"
        },
        {
            "authorId": "2312752210",
            "name": "Tim Durgin",
            "url": "https://www.semanticscholar.org/author/2312752210"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 271404281,
    "doi": "10.48550/arXiv.2407.16903",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 6,
    "paperId": "47467c34d79c359adec9eb54fa0d2076192741c0",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "US-China perspectives on extreme AI risks and global governance",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/47467c34d79c359adec9eb54fa0d2076192741c0",
    "venue": "arXiv.org",
    "year": 2024
}