{
    "abstract": "The increasing integration of Artificial Intelligence (AI) into everyday life makes it essential to explain AI-based decision-making in a way that is understandable to all users, including those with disabilities. Accessible explanations are crucial as accessibility in technology promotes digital inclusion and allows everyone, regardless of their physical, sensory, or cognitive abilities, to use these technologies effectively. This paper presents a systematic literature review of the research on the accessibility of Explainable Artificial Intelligence (XAI), specifically considering persons with sight loss. Our methodology includes searching several academic databases with search terms to capture intersections between XAI and accessibility. The results of this survey highlight the lack of research on Accessible XAI (AXAI) and stress the importance of including the disability community in XAI development to promote digital inclusion and accessibility and remove barriers. Most XAI techniques rely on visual explanations, such as heatmaps or graphs, which are not accessible to persons who are blind or have low vision. Therefore, it is necessary to develop explanation methods through non-visual modalities, such as auditory and tactile feedback, visual modalities accessible to persons with low vision, and personalized solutions that meet the needs of individuals, including those with multiple disabilities. We further emphasize the importance of integrating universal design principles into AI development practices to ensure that AI technologies are usable by everyone.",
    "arxivId": "2407.17484",
    "authors": [
        {
            "authorId": "7666132",
            "name": "C. Nwokoye",
            "url": "https://www.semanticscholar.org/author/7666132"
        },
        {
            "authorId": "2312905801",
            "name": "Maria J. P. Peixoto",
            "url": "https://www.semanticscholar.org/author/2312905801"
        },
        {
            "authorId": "2313266389",
            "name": "Akriti Pandey",
            "url": "https://www.semanticscholar.org/author/2313266389"
        },
        {
            "authorId": "2312920779",
            "name": "Lauren Pardy",
            "url": "https://www.semanticscholar.org/author/2312920779"
        },
        {
            "authorId": "2274354813",
            "name": "Mahadeo Sukhai",
            "url": "https://www.semanticscholar.org/author/2274354813"
        },
        {
            "authorId": "2312922985",
            "name": "Peter R. Lewis",
            "url": "https://www.semanticscholar.org/author/2312922985"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 271432150,
    "doi": "10.48550/arXiv.2407.17484",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "d44e3f5e252ffd8bd44cb1cd230988f951983b76",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "title": "A Survey of Accessible Explainable Artificial Intelligence Research",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/d44e3f5e252ffd8bd44cb1cd230988f951983b76",
    "venue": "arXiv.org",
    "year": 2024
}