{
    "abstract": "Industry 5.0, which focuses on human and Artificial Intelligence (AI) collaboration for performing different tasks in manufacturing, involves a higher number of robots, Internet of Things (IoTs) devices and interconnections, Augmented/Virtual Reality (AR), and other smart devices. The huge involvement of these devices and interconnection in various critical areas, such as economy, health, education and defense systems, poses several types of potential security flaws. AI itself has been proven a very effective and powerful tool in different areas of cybersecurity, such as intrusion detection, malware detection, and phishing detection, among others. Just as in many application areas, cybersecurity professionals were reluctant to accept black-box ML solutions for cybersecurity applications. This reluctance pushed forward the adoption of eXplainable Artificial Intelligence (XAI) as a tool that helps explain how decisions are made in ML-based systems. In this survey, we present a comprehensive study of different XAI-based intrusion detection systems for industry 5.0, and we also examine the impact of explainability and interpretability on Cybersecurity practices through the lens of Adversarial XIDS (Adv-XIDS) approaches. Furthermore, we analyze the possible opportunities and challenges in XAI cybersecurity systems for industry 5.0 that elicit future research toward XAI-based solutions to be adopted by high-stakes industry 5.0 applications. We believe this rigorous analysis will establish a foundational framework for subsequent research endeavors within the specified domain.",
    "arxivId": "2408.03335",
    "authors": [
        {
            "authorId": "2315293243",
            "name": "Naseem Khan",
            "url": "https://www.semanticscholar.org/author/2315293243"
        },
        {
            "authorId": "2315120614",
            "name": "Kashif Ahmad",
            "url": "https://www.semanticscholar.org/author/2315120614"
        },
        {
            "authorId": "2129693092",
            "name": "Aref Al-Tamimi",
            "url": "https://www.semanticscholar.org/author/2129693092"
        },
        {
            "authorId": "3158606",
            "name": "M. Alani",
            "url": "https://www.semanticscholar.org/author/3158606"
        },
        {
            "authorId": "2256848295",
            "name": "Amine Bermak",
            "url": "https://www.semanticscholar.org/author/2256848295"
        },
        {
            "authorId": "2315109933",
            "name": "Issa Khalil",
            "url": "https://www.semanticscholar.org/author/2315109933"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 271744978,
    "doi": "10.48550/arXiv.2408.03335",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "84a01069906610cadfa4eed438fc8fd6d930d528",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "title": "Explainable AI-based Intrusion Detection System for Industry 5.0: An Overview of the Literature, associated Challenges, the existing Solutions, and Potential Research Directions",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/84a01069906610cadfa4eed438fc8fd6d930d528",
    "venue": "arXiv.org",
    "year": 2024
}