{
    "abstract": "All over the world, political parties, politicians, and campaigns explore how Artificial Intelligence (AI) can help them win elections. However, the effects of these activities are unknown. We propose a framework for assessing AI's impact on elections by considering its application in various campaigning tasks. The electoral uses of AI vary widely, carrying different levels of concern and need for regulatory oversight. To account for this diversity, we group AI-enabled campaigning uses into three categories -- campaign operations, voter outreach, and deception. Using this framework, we provide the first systematic evidence from a preregistered representative survey and two preregistered experiments (n=7,635) on how Americans think about AI in elections and the effects of specific campaigning choices. We provide three significant findings. 1) the public distinguishes between different AI uses in elections, seeing AI uses predominantly negative but objecting most strongly to deceptive uses; 2) deceptive AI practices can have adverse effects on relevant attitudes and strengthen public support for stopping AI development; 3) Although deceptive electoral uses of AI are intensely disliked, they do not result in substantial favorability penalties for the parties involved. There is a misalignment of incentives for deceptive practices and their externalities. We cannot count on public opinion to provide strong enough incentives for parties to forgo tactical advantages from AI-enabled deception. There is a need for regulatory oversight and systematic outside monitoring of electoral uses of AI. Still, regulators should account for the diversity of AI uses and not completely disincentivize their electoral use.",
    "arxivId": "2408.12613",
    "authors": [
        {
            "authorId": "3060017",
            "name": "Andreas Jungherr",
            "url": "https://www.semanticscholar.org/author/3060017"
        },
        {
            "authorId": "3477958",
            "name": "Adrian Rauchfleisch",
            "url": "https://www.semanticscholar.org/author/3477958"
        },
        {
            "authorId": "2316859714",
            "name": "Alexander Wuttke",
            "url": "https://www.semanticscholar.org/author/2316859714"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 271946928,
    "doi": "10.48550/arXiv.2408.12613",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "ea7675bb82df901fae7d51e4d1d78484f6132e6a",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "Deceptive uses of Artificial Intelligence in elections strengthen support for AI ban",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/ea7675bb82df901fae7d51e4d1d78484f6132e6a",
    "venue": "arXiv.org",
    "year": 2024
}