{
    "abstract": "This article provides a critical overview of the recently approved Artificial Intelligence Act. It starts by presenting the main structure, objectives, and approach of Regulation (EU) 2024/1689. A definition of key concepts follows, and then the material and territorial scope, as well as the timing of application, are analyzed. Although the Regulation does not explicitly set out principles, the main ideas of fairness, accountability, transparency, and equity in AI underly a set of rules of the regulation. This is discussed before looking at the ill-defined set of forbidden AI practices (manipulation and e exploitation of vulnerabilities, social scoring, biometric identification and classification, and predictive policing). It is highlighted that those rules deal with behaviors rather than AI systems. The qualification and regulation of high-risk AI systems are tackled, alongside the obligation of transparency for certain systems, the regulation of general-purpose models, and the rules on certification, supervision, and sanctions. The text concludes that even if the overall framework can be deemed adequate and balanced, the approach is so complex that it risks defeating its own purpose of promoting responsible innovation within the European Union and beyond its borders.",
    "arxivId": "2409.00264",
    "authors": [
        {
            "authorId": "2319451880",
            "name": "Nuno Sousa e Silva",
            "url": "https://www.semanticscholar.org/author/2319451880"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 272366646,
    "doi": "10.48550/arXiv.2409.00264",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "d15cd18c26997255a0b4f4cec7735fdd513d4070",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Law",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "The Artificial Intelligence Act: critical overview",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/d15cd18c26997255a0b4f4cec7735fdd513d4070",
    "venue": "arXiv.org",
    "year": 2024
}