{
    "abstract": "This booklet,\"Unlocking the Wisdom of LLM Collaborative Intelligence,\"introduces the comprehensive work\"The Path to Artificial General Intelligence.\"Through ten aphorisms, it distills the core principles of LLM Collaborative Intelligence (LCI) as a promising framework toward achieving AGI. The booklet also offers titles, abstracts, and introductions from the main chapters, along with the first two chapters in full. The second edition, released this week, includes significant enhancements to Chapters 6 to 9 and a revised preface addressing Yann LeCun's skepticism about AGI. LeCun argues that LLMs lack memory, planning, and grounding, but we propose that LCI's collaborative architecture, involving multimodal LLMs with executive, legislative, and judicial roles, overcomes these limitations. Chapters on SocraSynth, EVINCE, consciousness modeling, and behavior modeling demonstrate that collaborative LLMs with checks and balances can achieve intelligence beyond any single model's capability. By combining complementary strengths, such as world modeling and advanced sensory capabilities, LCI enables models to work together and perceive reality beyond human limitations. As with human institutions, progress depends on cooperation, not isolation. Collaborative LLMs may unlock new levels of intelligence, paving the way toward AGI.",
    "arxivId": "2409.01007",
    "authors": [
        {
            "authorId": "2319398617",
            "name": "Edward Y. Chang",
            "url": "https://www.semanticscholar.org/author/2319398617"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 272367428,
    "doi": "10.48550/arXiv.2409.01007",
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "4760953fc628b0795e908972f9e95e9b8fa98d4e",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Linguistics",
            "source": "s2-fos-model"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        }
    ],
    "title": "Unlocking the Wisdom of Large Language Models: An Introduction to The Path to Artificial General Intelligence",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/4760953fc628b0795e908972f9e95e9b8fa98d4e",
    "venue": "arXiv.org",
    "year": 2024
}