{
    "abstract": "Building artificially intelligent geospatial systems require rapid delivery of spatial data analysis at massive scales with minimal human intervention. Depending upon their intended use, data analysis may also entail model assessment and uncertainty quantification. This article devises transfer learning frameworks for deployment in artificially intelligent systems, where a massive data set is split into smaller data sets that stream into the analytical framework to propagate learning and assimilate inference for the entire data set. Specifically, we introduce Bayesian predictive stacking for multivariate spatial data and demonstrate its effectiveness in rapidly analyzing massive data sets. Furthermore, we make inference feasible in a reasonable amount of time, and without excessively demanding hardware settings. We illustrate the effectiveness of this approach in extensive simulation experiments and subsequently analyze massive data sets in climate science on sea surface temperatures and on vegetation index.",
    "arxivId": "2410.09504",
    "authors": [
        {
            "authorId": "2325905263",
            "name": "Luca Presicce",
            "url": "https://www.semanticscholar.org/author/2325905263"
        },
        {
            "authorId": "2325897177",
            "name": "Sudipto Banerjee",
            "url": "https://www.semanticscholar.org/author/2325897177"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 273345988,
    "doi": null,
    "fieldsOfStudy": [
        "Mathematics"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "4949f125aab2cd85abe7f3b193750aacc0ee7c16",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Geography",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "Bayesian Transfer Learning for Artificially Intelligent Geospatial Systems: A Predictive Stacking Approach",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/4949f125aab2cd85abe7f3b193750aacc0ee7c16",
    "venue": "",
    "year": 2024
}