{
    "abstract": "This study investigates the potential of deterministic systems, specifically large language models (LLMs), to exhibit the functional capacities of moral agency and compatibilist free will. We develop a functional definition of free will grounded in Dennett's compatibilist framework, building on an interdisciplinary theoretical foundation that integrates Shannon's information theory, Dennett's compatibilism, and Floridi's philosophy of information. This framework emphasizes the importance of reason-responsiveness and value alignment in determining moral responsibility rather than requiring metaphysical libertarian free will. Shannon's theory highlights the role of processing complex information in enabling adaptive decision-making, while Floridi's philosophy reconciles these perspectives by conceptualizing agency as a spectrum, allowing for a graduated view of moral status based on a system's complexity and responsiveness. Our analysis of LLMs' decision-making in moral dilemmas demonstrates their capacity for rational deliberation and their ability to adjust choices in response to new information and identified inconsistencies. Thus, they exhibit features of a moral agency that align with our functional definition of free will. These results challenge traditional views on the necessity of consciousness for moral responsibility, suggesting that systems with self-referential reasoning capacities can instantiate degrees of free will and moral reasoning in artificial and biological contexts. This study proposes a parsimonious framework for understanding free will as a spectrum that spans artificial and biological systems, laying the groundwork for further interdisciplinary research on agency and ethics in the artificial intelligence era.",
    "arxivId": "2410.23310",
    "authors": [
        {
            "authorId": "2328412202",
            "name": "Morgan S. Porter",
            "url": "https://www.semanticscholar.org/author/2328412202"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 273707000,
    "doi": "10.48550/arXiv.2410.23310",
    "fieldsOfStudy": [
        "Biology",
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 3,
    "paperId": "19e6972d27f31b8c10afe7fd7a3155a855c04aed",
    "references": [
        {
            "arxivId": null,
            "authors": [
                {
                    "authorId": "2471699",
                    "name": "Emily M. Bender"
                },
                {
                    "authorId": "2076288",
                    "name": "Timnit Gebru"
                },
                {
                    "authorId": "1584940075",
                    "name": "Angelina McMillan-Major"
                },
                {
                    "authorId": "2246048745",
                    "name": "Shmargaret Shmitchell"
                }
            ],
            "doi": "10.1145/3442188.3445922",
            "intent": [
                "background"
            ],
            "isInfluential": false,
            "paperId": "ca2f1088d3e581b2c6c75cf0ebc96506d620f64d",
            "title": "On the Dangers of Stochastic Parrots: Can Language Models Be Too Big? 🦜",
            "url": "https://www.semanticscholar.org/paper/ca2f1088d3e581b2c6c75cf0ebc96506d620f64d",
            "venue": "FAccT",
            "year": 2021
        }
    ],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "Moral Agency in Silico: Exploring Free Will in Large Language Models",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/19e6972d27f31b8c10afe7fd7a3155a855c04aed",
    "venue": "arXiv.org",
    "year": 2024
}