{
    "abstract": "The rapid evolution of artificial intelligence, especially through multi-modal large language models, has redefined user interactions, enabling responses that are contextually rich and human-like. As AI becomes an integral part of daily life, a new frontier has emerged: developing systems that not only understand spatial and sensory data but also interpret temporal contexts to build long-term, personalized memories. This report introduces Lucia, an open-source Temporal Computing Platform designed to enhance human cognition by capturing and utilizing continuous contextual memory. Lucia introduces a lightweight, wearable device that excels in both comfort and real-time data accessibility, distinguishing itself from existing devices that typically prioritize either wearability or perceptual capabilities alone. By recording and interpreting daily activities over time, Lucia enables users to access a robust temporal memory, enhancing cognitive processes such as decision-making and memory recall.",
    "arxivId": "2411.12778",
    "authors": [
        {
            "authorId": "2329005418",
            "name": "Weizhe Lin",
            "url": "https://www.semanticscholar.org/author/2329005418"
        },
        {
            "authorId": "2331574482",
            "name": "Junxiao Shen",
            "url": "https://www.semanticscholar.org/author/2331574482"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 274149866,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "a15ce8ca334906d10b7a1ecdae1ff754afd68c14",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "Lucia: A Temporal Computing Platform for Contextual Intelligence",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/a15ce8ca334906d10b7a1ecdae1ff754afd68c14",
    "venue": "",
    "year": 2024
}