{
    "abstract": "This study aimed to identify and analyze the characteristics of highly cited publications in the field of artificial intelligence within the Science Citation Index Expanded from 1991 to 2022. The assessment focused on documents that garnered 100 citations or more from the Web of Science Core Collection, spanning from their publication date to the end of 2022. Various aspects of these documents were analyzed, encompassing document types, the distribution of annual production, the average number of citations per publication, Web of Science categories, and journals. Moreover, the publication performance of countries, institutions, and authors underwent evaluation through six publication indicators and associated citation metrics. To facilitate a comprehensive comparison of the authors research performance, the Y-index was employed. The outcomes of the analysis revealed that a majority of the highly cited articles were published within the Web of Science categories of\"artificial intelligence computer science\"and\"electrical and electronic engineering\". Notably, the United States exhibited dominance across all six publication indicators. Within the realm of average citations per publication, the United Kingdom emerged as a leader for independent articles, first-author articles, and corresponding-author articles. Exceptionally, the Chinese Academy of Sciences in China and the Massachusetts Institute of Technology (MIT) in the USA, contributed significantly. The significant impact of highly cited articles extended to the output of Stanford University in the USA. B.L. Bassler published the most highly cited articles. Upon employing the Y-index analysis, J.E.P. Santos was identified as having the highest potential for publication. In addition to the primary analysis, this study also presented nine classic articles that have left an indelible mark on artificial intelligence research.",
    "arxivId": "2411.10491",
    "authors": [
        {
            "authorId": "2331331953",
            "name": "Yuh-Shan Ho",
            "url": "https://www.semanticscholar.org/author/2331331953"
        },
        {
            "authorId": "2047188282",
            "name": "J. Prieto-Gutierrez",
            "url": "https://www.semanticscholar.org/author/2047188282"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 274131581,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "13c1c483e9b84e17e44ba5eae4683398399a50d9",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "A Bibliometric Analysis of Highly Cited Artificial Intelligence Publications in Science Citation Index Expanded",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/13c1c483e9b84e17e44ba5eae4683398399a50d9",
    "venue": "",
    "year": 2024
}