{
    "abstract": "One of the challenges artificial intelligence (AI) faces is how a collection of agents coordinate their behaviour to achieve goals that are not reachable by any single agent. In a recent article by Ozmen et al this was framed as one of six grand challenges: That AI needs to respect human cognitive processes at the human-AI interaction frontier. We suggest that this extends to the AI-AI frontier and that it should also reflect human psychology, as it is the only successful framework we have from which to build out. In this extended abstract we first make the case for collective intelligence in a general setting, drawing on recent work from single neuron complexity in neural networks and ant network adaptability in ant colonies. From there we introduce how species relate to one another in an ecological network via niche selection, niche choice, and niche conformity with the aim of forming an analogy with human social network development as new agents join together and coordinate. From there we show how our social structures are influenced by our neuro-physiology, our psychology, and our language. This emphasises how individual people within a social network influence the structure and performance of that network in complex tasks, and that cognitive faculties such as Theory of Mind play a central role. We finish by discussing the current state of the art in AI and where there is potential for further development of a socially embodied collective artificial intelligence that is capable of guiding its own social structures.",
    "arxivId": "2411.09169",
    "authors": [
        {
            "authorId": "2284678068",
            "name": "Michael S. Harr'e",
            "url": "https://www.semanticscholar.org/author/2284678068"
        },
        {
            "authorId": "2330243481",
            "name": "Jaime Ruiz-Serra",
            "url": "https://www.semanticscholar.org/author/2330243481"
        },
        {
            "authorId": "2330588372",
            "name": "Catherine Drysdale",
            "url": "https://www.semanticscholar.org/author/2330588372"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 274023743,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science",
        "Physics"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "a9924729ace4d050393e84d50c250bf445998543",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "title": "Artificial Theory of Mind and Self-Guided Social Organisation",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/a9924729ace4d050393e84d50c250bf445998543",
    "venue": "",
    "year": 2024
}