{
    "abstract": "Advancements in artificial intelligence (AI) have transformed many scientific fields, with microbiology and microbiome research now experiencing significant breakthroughs through machine learning and deep learning applications. This review provides a comprehensive overview of AI-driven approaches tailored for microbiology and microbiome studies, emphasizing both technical advancements and biological insights. We begin with an introduction to foundational AI techniques, including primary machine learning paradigms and various deep learning architectures, and offer guidance on choosing between machine learning and deep learning methods based on specific research goals. The primary section on application scenarios spans diverse research areas, from taxonomic profiling, functional annotation&prediction, microbe-X interactions, microbial ecology, metabolic modeling, precision nutrition, clinical microbiology, to prevention&therapeutics. Finally, we discuss challenges unique to this field, including the balance between interpretability and complexity, the\"small n, large p\"problem, and the critical need for standardized benchmarking datasets to validate and compare models. Together, this review underscores AI's transformative role in microbiology and microbiome research, paving the way for innovative methodologies and applications that enhance our understanding of microbial life and its impact on our planet and our health.",
    "arxivId": "2411.01098",
    "authors": [
        {
            "authorId": "1600333448",
            "name": "Xu-Wen Wang",
            "url": "https://www.semanticscholar.org/author/1600333448"
        },
        {
            "authorId": "2329120504",
            "name": "Tong Wang",
            "url": "https://www.semanticscholar.org/author/2329120504"
        },
        {
            "authorId": "2329131142",
            "name": "Yang-Yu Liu",
            "url": "https://www.semanticscholar.org/author/2329131142"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 273811764,
    "doi": null,
    "fieldsOfStudy": [
        "Biology",
        "Computer Science",
        "Mathematics"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "6768b14d6666d9b407d4d521db0eea6464c7bc66",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Biology",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Mathematics",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Biology",
            "source": "s2-fos-model"
        },
        {
            "category": "Environmental Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        }
    ],
    "title": "Artificial Intelligence for Microbiology and Microbiome Research",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/6768b14d6666d9b407d4d521db0eea6464c7bc66",
    "venue": "",
    "year": 2024
}