{
    "abstract": "In this paper, we propose the development of an interactive platform between humans and a dual-arm robotic system based on the Robot Operating System (ROS) and a multimodal artificial intelligence model. Our proposed platform consists of two main components: a dual-arm robotic hardware system and software that includes image processing tasks and natural language processing using a 3D camera and embedded computing. First, we designed and developed a dual-arm robotic system with a positional accuracy of less than 2 cm, capable of operating independently, performing industrial and service tasks while simultaneously simulating and modeling the robot in the ROS environment. Second, artificial intelligence models for image processing are integrated to execute object picking and classification tasks with an accuracy of over 90%. Finally, we developed remote control software using voice commands through a natural language processing model. Experimental results demonstrate the accuracy of the multimodal artificial intelligence model and the flexibility of the dual-arm robotic system in interactive human environments.",
    "arxivId": "2411.05342",
    "authors": [
        {
            "authorId": "2199257946",
            "name": "Thanh Nguyen Canh",
            "url": "https://www.semanticscholar.org/author/2199257946"
        },
        {
            "authorId": "2330083473",
            "name": "Ba Phuong Nguyen",
            "url": "https://www.semanticscholar.org/author/2330083473"
        },
        {
            "authorId": "2330239093",
            "name": "Hong Quan Tran",
            "url": "https://www.semanticscholar.org/author/2330239093"
        },
        {
            "authorId": "2043593",
            "name": "Xiem HoangVan",
            "url": "https://www.semanticscholar.org/author/2043593"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 273950423,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "9f974c1437ce07431b07452de8072451a63b4706",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "title": "Development of a Human-Robot Interaction Platform for Dual-Arm Robots Based on ROS and Multimodal Artificial Intelligence",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/9f974c1437ce07431b07452de8072451a63b4706",
    "venue": "",
    "year": 2024
}