{
    "abstract": "Collective Intelligence plays a central role in a large variety of fields, from economics and evolutionary theory to neural networks and eusocial insects, and it is also core to much of the work on emergence and self-organisation in complex systems theory. However, in human collective intelligence there is still much more to be understood in the relationship between specific psychological processes at the individual level and the emergence of self-organised structures at the social level. Previously psychological factors have played a relatively minor role in the study of collective intelligence as the principles are often quite general and applicable to humans just as readily as insects or other agents without sophisticated psychologies. In this article we emphasise, with examples from other complex adaptive systems, the broad applicability of collective intelligence principles while the mechanisms and time-scales differ significantly between examples. We contend that flexible collective intelligence in human social settings is improved by our use of a specific cognitive tool: our Theory of Mind. We identify several key characteristics of psychologically mediated collective intelligence and show that the development of a Theory of Mind is a crucial factor distinguishing social collective intelligence from general collective intelligence. We then place these capabilities in the context of the next steps in artificial intelligence embedded in a future that includes an effective human-AI hybrid social ecology.",
    "arxivId": "2411.09168",
    "authors": [
        {
            "authorId": "2284678068",
            "name": "Michael S. Harr'e",
            "url": "https://www.semanticscholar.org/author/2284678068"
        },
        {
            "authorId": "2330588372",
            "name": "Catherine Drysdale",
            "url": "https://www.semanticscholar.org/author/2330588372"
        },
        {
            "authorId": "2330243481",
            "name": "Jaime Ruiz-Serra",
            "url": "https://www.semanticscholar.org/author/2330243481"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 274023106,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science",
        "Physics"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "0ea06a664166978d95adf4af28565f37e2ccf705",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "title": "Theory of Mind Enhances Collective Intelligence",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/0ea06a664166978d95adf4af28565f37e2ccf705",
    "venue": "",
    "year": 2024
}