{
    "abstract": "Design and manufacturing of integrated circuits predominantly use a globally distributed semiconductor supply chain involving diverse entities. The modern semiconductor supply chain has been designed to boost production efficiency, but is filled with major security concerns such as malicious modifications (hardware Trojans), reverse engineering (RE), and cloning. While being deployed, digital systems are also subject to a plethora of threats such as power, timing, and electromagnetic (EM) side channel attacks. Many Design-for-Security (DFS) solutions have been proposed to deal with these vulnerabilities, and such solutions (DFS) relays on strategic modifications (e.g., logic locking, side channel resilient masking, and dummy logic insertion) of the digital designs for ensuring a higher level of security. However, most of these DFS strategies lack robust formalism, are often not human-understandable, and require an extensive amount of human expert effort during their development/use. All of these factors make it difficult to keep up with the ever growing number of microelectronic vulnerabilities. In this work, we propose X-DFS, an explainable Artificial Intelligence (AI) guided DFS solution-space exploration approach that can dramatically cut down the mitigation strategy development/use time while enriching our understanding of the vulnerability by providing human-understandable decision rationale. We implement X-DFS and comprehensively evaluate it for reverse engineering threats (SAIL, SWEEP, and OMLA) and formalize a generalized mechanism for applying X-DFS to defend against other threats such as hardware Trojans, fault attacks, and side channel attacks for seamless future extensions.",
    "arxivId": "2411.07308",
    "authors": [
        {
            "authorId": "2280223805",
            "name": "Tanzim Mahfuz",
            "url": "https://www.semanticscholar.org/author/2280223805"
        },
        {
            "authorId": "145787089",
            "name": "S. Bhunia",
            "url": "https://www.semanticscholar.org/author/145787089"
        },
        {
            "authorId": "145293829",
            "name": "Prabuddha Chakraborty",
            "url": "https://www.semanticscholar.org/author/145293829"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 273969745,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "bae620c3ed3aa91d75403d2ed81b676ff5e391f1",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "title": "X-DFS: Explainable Artificial Intelligence Guided Design-for-Security Solution Space Exploration",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/bae620c3ed3aa91d75403d2ed81b676ff5e391f1",
    "venue": "",
    "year": 2024
}