{
    "abstract": "Understanding public perception of artificial intelligence (AI) and the tradeoffs between potential risks and benefits is crucial, as these perceptions might shape policy decisions, influence innovation trajectories for successful market strategies, and determine individual and societal acceptance of AI technologies. Using a representative sample of 1100 participants from Germany, this study examines mental models of AI. Participants quantitatively evaluated 71 statements about AI's future capabilities (e.g., autonomous driving, medical care, art, politics, warfare, and societal divides), assessing the expected likelihood of occurrence, perceived risks, benefits, and overall value. We present rankings of these projections alongside visual mappings illustrating public risk-benefit tradeoffs. While many scenarios were deemed likely, participants often associated them with high risks, limited benefits, and low overall value. Across all scenarios, 96.4% ($r^2=96.4\\%$) of the variance in value assessment can be explained by perceived risks ($\\beta=-.504$) and perceived benefits ($\\beta=+.710$), with no significant relation to expected likelihood. Demographics and personality traits influenced perceptions of risks, benefits, and overall evaluations, underscoring the importance of increasing AI literacy and tailoring public information to diverse user needs. These findings provide actionable insights for researchers, developers, and policymakers by highlighting critical public concerns and individual factors essential to align AI development with individual values.",
    "arxivId": "2411.19356",
    "authors": [
        {
            "authorId": "2812191",
            "name": "P. Brauner",
            "url": "https://www.semanticscholar.org/author/2812191"
        },
        {
            "authorId": "2185662333",
            "name": "Felix Glawe",
            "url": "https://www.semanticscholar.org/author/2185662333"
        },
        {
            "authorId": "1816721575",
            "name": "Gian Luca Liehner",
            "url": "https://www.semanticscholar.org/author/1816721575"
        },
        {
            "authorId": "3144719",
            "name": "Luisa Vervier",
            "url": "https://www.semanticscholar.org/author/3144719"
        },
        {
            "authorId": "2266847611",
            "name": "Martina Ziefle",
            "url": "https://www.semanticscholar.org/author/2266847611"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 274423076,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "88864d8ff281e30616bc760263401968d3879451",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Political Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Sociology",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "title": "Mapping Public Perception of Artificial Intelligence: Expectations, Risk-Benefit Tradeoffs, and Value As Determinants for Societal Acceptance",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/88864d8ff281e30616bc760263401968d3879451",
    "venue": "",
    "year": 2024
}