{
    "abstract": "As AI systems increasingly operate with autonomy and adaptability, the traditional boundaries of moral responsibility in techno-social systems are being challenged. This paper explores the evolving discourse on the delegation of responsibilities to intelligent autonomous agents and the ethical implications of such practices. Synthesizing recent developments in AI ethics, including concepts of distributed responsibility and ethical AI by design, the paper proposes a functionalist perspective as a framework. This perspective views moral responsibility not as an individual trait but as a role within a socio-technical system, distributed among human and artificial agents. As an example of 'AI ethical by design,' we present Basti and Vitiello's implementation. They suggest that AI can act as artificial moral agents by learning ethical guidelines and using Deontic Higher-Order Logic to assess decisions ethically. Motivated by the possible speed and scale beyond human supervision and ethical implications, the paper argues for 'AI ethical by design', while acknowledging the distributed, shared, and dynamic nature of responsibility. This functionalist approach offers a practical framework for navigating the complexities of AI ethics in a rapidly evolving technological landscape.",
    "arxivId": "2411.15147",
    "authors": [
        {
            "authorId": "1403731773",
            "name": "G. Dodig-Crnkovic",
            "url": "https://www.semanticscholar.org/author/1403731773"
        },
        {
            "authorId": "2332099051",
            "name": "Gianfranco Basti",
            "url": "https://www.semanticscholar.org/author/2332099051"
        },
        {
            "authorId": "40237720",
            "name": "Tobias Holstein",
            "url": "https://www.semanticscholar.org/author/40237720"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 274234966,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "7f5e1500f4776f2b8eaa2873271941545827567a",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        }
    ],
    "title": "Delegating Responsibilities to Intelligent Autonomous Systems: Challenges and Benefits",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/7f5e1500f4776f2b8eaa2873271941545827567a",
    "venue": "",
    "year": 2024
}