{
    "abstract": "In many situations humans have to reason with inconsistent knowledge. These inconsistencies may occur due to not fully reliable sources of information. In order to reason with inconsistent knowledge, it is not possible to view a set of premisses as absolute truths as is done in predicate logic. Viewing the set of premisses as a set of assumptions, however, it is possible to deduce useful conclusions from an inconsistent set of premisses. In this paper a logic for reasoning with inconsistent knowledge is described. This logic is a generalization of the work of N. Rescher [15]. In the logic a reliability relation is used to choose between incompatible assumptions. These choices are only made when a contradiction is derived. As long as no contradiction is derived, the knowledge is assumed to be consistent. This makes it possible to define an argumentation-based deduction process for the logic. For the logic a semantics based on the ideas of Y. Shoham [22, 23], is defined. It turns out that the semantics for the logic is a preferential semantics according to the definition S. Kraus, D. Lehmann and M. Magidor [12]. Therefore the logic is a logic of system P and possesses all the properties of an ideal non-monotonic logic.",
    "arxivId": "2411.10197",
    "authors": [
        {
            "authorId": "2331176565",
            "name": "Nico Roos",
            "url": "https://www.semanticscholar.org/author/2331176565"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 274116931,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "99d4ad0e5ecc4c5c39641293594616e646267268",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        }
    ],
    "title": "A logic for reasoning with inconsistent knowledge -- A reformulation using nowadays terminology (2024)",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/99d4ad0e5ecc4c5c39641293594616e646267268",
    "venue": "",
    "year": 2024
}