{
    "abstract": "The continuous development of artificial intelligence (AI) theory has propelled this field to unprecedented heights, owing to the relentless efforts of scholars and researchers. In the medical realm, AI takes a pivotal role, leveraging robust machine learning (ML) algorithms. AI technology in medical imaging aids physicians in X-ray, computed tomography (CT) scans, and magnetic resonance imaging (MRI) diagnoses, conducts pattern recognition and disease prediction based on acoustic data, delivers prognoses on disease types and developmental trends for patients, and employs intelligent health management wearable devices with human-computer interaction technology to name but a few. While these well-established applications have significantly assisted in medical field diagnoses, clinical decision-making, and management, collaboration between the medical and AI sectors faces an urgent challenge: How to substantiate the reliability of decision-making? The underlying issue stems from the conflict between the demand for accountability and result transparency in medical scenarios and the black-box model traits of AI. This article reviews recent research grounded in explainable artificial intelligence (XAI), with an emphasis on medical practices within the visual, audio, and multimodal perspectives. We endeavour to categorise and synthesise these practices, aiming to provide support and guidance for future researchers and healthcare professionals.",
    "arxivId": "2412.01829",
    "authors": [
        {
            "authorId": null,
            "name": "Qiyang Sun",
            "url": null
        },
        {
            "authorId": "1569540596",
            "name": "Alican Akman",
            "url": "https://www.semanticscholar.org/author/1569540596"
        },
        {
            "authorId": "2275314337",
            "name": "Björn W. Schuller",
            "url": "https://www.semanticscholar.org/author/2275314337"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 274446454,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "c87d6af4730f41903c1d792cb7f9701bc88cf3eb",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Medicine",
            "source": "s2-fos-model"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        }
    ],
    "title": "Explainable Artificial Intelligence for Medical Applications: A Review",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/c87d6af4730f41903c1d792cb7f9701bc88cf3eb",
    "venue": "",
    "year": 2024
}