{
    "abstract": "Are we alone? It is a compelling question that human beings have confronted for centuries. The search for extraterrestrial life is a broad range of quests for finding the simple forms of life up to intelligent beings in the Universe. The plausible assumption is that there is a chance that intelligent life will followed by advanced civilization equipped or even dominated by artificial intelligence (AI). In this work, we categorize the advanced civilizations (on an equal footing, an AI-dominated civilization) on the Kardashev scale. We propose a new scale known as space exploration distance to measure civilization advancement. We propose a relation between this length and the Kardashev scale. Then, we suggest the idea that advanced civilizations will use primordial black holes as sources of harvesting energy. We calculate the energy harvested by calculating the space exploration distance. Finally, we propose an observational method to detect the possibility of extraterrestrial AI using Dyson spheres-like structures around primordial black holes in the Milky Way and other galaxies.",
    "arxivId": "2412.02671",
    "authors": [
        {
            "authorId": "101715713",
            "name": "S. Baghram",
            "url": "https://www.semanticscholar.org/author/101715713"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 274445738,
    "doi": null,
    "fieldsOfStudy": [
        "Physics"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "16a5d8e0551875e0826d171a35ad29b175d9bca2",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Physics",
            "source": "external"
        },
        {
            "category": "Physics",
            "source": "s2-fos-model"
        },
        {
            "category": "Philosophy",
            "source": "s2-fos-model"
        }
    ],
    "title": "In Search of Extraterrestrial Artificial Intelligence through the Dyson Sphere-like structures around the Primordial Black Holes",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/16a5d8e0551875e0826d171a35ad29b175d9bca2",
    "venue": "",
    "year": 2024
}