{
    "abstract": "Creativity is a fundamental skill of human cognition. We use textual forma mentis networks (TFMN) to extract network (semantic/syntactic associations) and emotional features from approximately one thousand human- and GPT3.5-generated stories. Using Explainable Artificial Intelligence (XAI), we test whether features relative to Mednick's associative theory of creativity can explain creativity ratings assigned by humans and GPT-3.5. Using XGBoost, we examine three scenarios: (i) human ratings of human stories, (ii) GPT-3.5 ratings of human stories, and (iii) GPT-3.5 ratings of GPT-generated stories. Our findings reveal that GPT-3.5 ratings differ significantly from human ratings not only in terms of correlations but also because of feature patterns identified with XAI methods. GPT-3.5 favours 'its own' stories and rates human stories differently from humans. Feature importance analysis with SHAP scores shows that: (i) network features are more predictive for human creativity ratings but also for GPT-3.5's ratings of human stories; (ii) emotional features played a greater role than semantic/syntactic network structure in GPT-3.5 rating its own stories. These quantitative results underscore key limitations in GPT-3.5's ability to align with human assessments of creativity. We emphasise the need for caution when using GPT-3.5 to assess and generate creative content, as it does not yet capture the nuanced complexity that characterises human creativity.",
    "arxivId": "2412.00530",
    "authors": [
        {
            "authorId": "2333361195",
            "name": "Edith Haim",
            "url": "https://www.semanticscholar.org/author/2333361195"
        },
        {
            "authorId": "2333361480",
            "name": "Natalie Fischer",
            "url": "https://www.semanticscholar.org/author/2333361480"
        },
        {
            "authorId": "150293810",
            "name": "Salvatore Citraro",
            "url": "https://www.semanticscholar.org/author/150293810"
        },
        {
            "authorId": "2297283092",
            "name": "Giulio Rossetti",
            "url": "https://www.semanticscholar.org/author/2297283092"
        },
        {
            "authorId": "2297281152",
            "name": "Massimo Stella",
            "url": "https://www.semanticscholar.org/author/2297281152"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 274437104,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "ca1c9428f371b06a1eed81f4c9e1982f3e08fe13",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Psychology",
            "source": "s2-fos-model"
        }
    ],
    "title": "Forma mentis networks predict creativity ratings of short texts via interpretable artificial intelligence in human and GPT-simulated raters",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/ca1c9428f371b06a1eed81f4c9e1982f3e08fe13",
    "venue": "",
    "year": 2024
}