{
    "abstract": "The rise of intelligent autonomous systems, especially in robotics and autonomous agents, has created a critical need for robust communication middleware that can ensure real-time processing of extensive sensor data. Current robotics middleware like Robot Operating System (ROS) 2 faces challenges with nondeterminism and high communication latency when dealing with large data across multiple subscribers on a multi-core compute platform. To address these issues, we present High-Performance Robotic Middleware (HPRM), built on top of the deterministic coordination language Lingua Franca (LF). HPRM employs optimizations including an in-memory object store for efficient zero-copy transfer of large payloads, adaptive serialization to minimize serialization overhead, and an eager protocol with real-time sockets to reduce handshake latency. Benchmarks show HPRM achieves up to 173x lower latency than ROS2 when broadcasting large messages to multiple nodes. We then demonstrate the benefits of HPRM by integrating it with the CARLA simulator and running reinforcement learning agents along with object detection workloads. In the CARLA autonomous driving application, HPRM attains 91.1% lower latency than ROS2. The deterministic coordination semantics of HPRM, combined with its optimized IPC mechanisms, enable efficient and predictable real-time communication for intelligent autonomous systems.",
    "arxivId": "2412.01799",
    "authors": [
        {
            "authorId": "2272531875",
            "name": "Jacky Kwok",
            "url": "https://www.semanticscholar.org/author/2272531875"
        },
        {
            "authorId": "2333371582",
            "name": "Shulu Li",
            "url": "https://www.semanticscholar.org/author/2333371582"
        },
        {
            "authorId": "51304485",
            "name": "Marten Lohstroh",
            "url": "https://www.semanticscholar.org/author/51304485"
        },
        {
            "authorId": "2333402377",
            "name": "Edward A. Lee",
            "url": "https://www.semanticscholar.org/author/2333402377"
        }
    ],
    "citationVelocity": 0,
    "citations": [],
    "corpusId": 274437707,
    "doi": null,
    "fieldsOfStudy": [
        "Computer Science"
    ],
    "influentialCitationCount": 0,
    "isOpenAccess": false,
    "isPublisherLicensed": true,
    "is_open_access": false,
    "is_publisher_licensed": true,
    "numCitedBy": 0,
    "numCiting": 0,
    "paperId": "565637bfcda337031a86488b8eae1f126e7d28cb",
    "references": [],
    "s2FieldsOfStudy": [
        {
            "category": "Computer Science",
            "source": "external"
        },
        {
            "category": "Computer Science",
            "source": "s2-fos-model"
        },
        {
            "category": "Engineering",
            "source": "s2-fos-model"
        }
    ],
    "title": "HPRM: High-Performance Robotic Middleware for Intelligent Autonomous Systems",
    "topics": [],
    "url": "https://www.semanticscholar.org/paper/565637bfcda337031a86488b8eae1f126e7d28cb",
    "venue": "",
    "year": 2024
}